lkolbly/cmsis-svd/data/TexasInstruments/LM3S5U91.svd
        <register>
          <name>FIFO6</name>
          <description>USB FIFO Endpoint 6</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO6_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO7</name>
          <description>USB FIFO Endpoint 7</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO7_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO8</name>
          <description>USB FIFO Endpoint 8</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO8_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO9</name>
          <description>USB FIFO Endpoint 9</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO9_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO10</name>
          <description>USB FIFO Endpoint 10</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO10_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO11</name>
          <description>USB FIFO Endpoint 11</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO11_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO12</name>
          <description>USB FIFO Endpoint 12</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO12_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO13</name>
          <description>USB FIFO Endpoint 13</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO13_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO14</name>
          <description>USB FIFO Endpoint 14</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO14_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO15</name>
          <description>USB FIFO Endpoint 15</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO15_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVCTL</name>
          <description>USB Device Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_DEVCTL_SESSION</name>
              <description>Session Start/End</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_HOSTREQ</name>
              <description>Host Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_HOST</name>
              <description>Host Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_VBUS</name>
              <description>VBUS Level</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_NONE</name>
                  <description>Below SessionEnd</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_SEND</name>
                  <description>Above SessionEnd, below AValid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_AVALID</name>
                  <description>Above AValid, below VBUSValid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_VALID</name>
                  <description>Above VBUSValid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_DEVCTL_LSDEV</name>
              <description>Low-Speed Device Detected</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_FSDEV</name>
              <description>Full-Speed Device Detected</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_DEV</name>
              <description>Device Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOSZ</name>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x00000062</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOSZ</name>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x00000063</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOADD</name>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOADD</name>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTIM</name>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VPLEN</name>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x0000007B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_VPLEN_VPLEN</name>
              <description>VBUS Pulse Length</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEOF</name>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FSEOF_FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSEOF</name>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LSEOF_LSEOFG</name>
              <description>Low-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR0</name>
          <description>USB Transmit Functional Address Endpoint 0</description>
          <addressOffset>0x00000080</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR0_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR0</name>
          <description>USB Transmit Hub Address Endpoint 0</description>
          <addressOffset>0x00000082</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR0_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR0_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT0</name>
          <description>USB Transmit Hub Port Endpoint 0</description>
          <addressOffset>0x00000083</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT0_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR1</name>
          <description>USB Transmit Functional Address Endpoint 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR1</name>
          <description>USB Transmit Hub Address Endpoint 1</description>
          <addressOffset>0x0000008A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR1_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT1</name>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x0000008B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR1</name>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR1</name>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000008E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR1_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT1</name>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000008F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR2</name>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000090</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR2</name>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000092</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT2</name>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000093</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR2</name>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000094</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR2</name>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x00000096</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT2</name>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x00000097</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR3</name>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000098</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR3</name>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x0000009A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR3_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT3</name>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x0000009B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
