lkolbly/cmsis-svd/data/TexasInstruments/LM3S5U91.svd
        <register>
          <name>TXHUBADDR11</name>
          <description>USB Transmit Hub Address Endpoint 11</description>
          <addressOffset>0x000000DA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT11</name>
          <description>USB Transmit Hub Port Endpoint 11</description>
          <addressOffset>0x000000DB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR11</name>
          <description>USB Receive Functional Address Endpoint 11</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR11_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR11</name>
          <description>USB Receive Hub Address Endpoint 11</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT11</name>
          <description>USB Receive Hub Port Endpoint 11</description>
          <addressOffset>0x000000DF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR12</name>
          <description>USB Transmit Functional Address Endpoint 12</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR12</name>
          <description>USB Transmit Hub Address Endpoint 12</description>
          <addressOffset>0x000000E2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT12</name>
          <description>USB Transmit Hub Port Endpoint 12</description>
          <addressOffset>0x000000E3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR12</name>
          <description>USB Receive Functional Address Endpoint 12</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR12</name>
          <description>USB Receive Hub Address Endpoint 12</description>
          <addressOffset>0x000000E6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT12</name>
          <description>USB Receive Hub Port Endpoint 12</description>
          <addressOffset>0x000000E7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR13</name>
          <description>USB Transmit Functional Address Endpoint 13</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR13_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR13</name>
          <description>USB Transmit Hub Address Endpoint 13</description>
          <addressOffset>0x000000EA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR13_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR13_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT13</name>
          <description>USB Transmit Hub Port Endpoint 13</description>
          <addressOffset>0x000000EB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT13_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR13</name>
          <description>USB Receive Functional Address Endpoint 13</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR13_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR13</name>
          <description>USB Receive Hub Address Endpoint 13</description>
          <addressOffset>0x000000EE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR13_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR13_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT13</name>
          <description>USB Receive Hub Port Endpoint 13</description>
          <addressOffset>0x000000EF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT13_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR14</name>
          <description>USB Transmit Functional Address Endpoint 14</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR14_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR14</name>
          <description>USB Transmit Hub Address Endpoint 14</description>
          <addressOffset>0x000000F2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR14_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR14_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT14</name>
          <description>USB Transmit Hub Port Endpoint 14</description>
          <addressOffset>0x000000F3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT14_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR14</name>
          <description>USB Receive Functional Address Endpoint 14</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR14_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR14</name>
          <description>USB Receive Hub Address Endpoint 14</description>
          <addressOffset>0x000000F6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR14_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR14_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT14</name>
          <description>USB Receive Hub Port Endpoint 14</description>
          <addressOffset>0x000000F7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT14_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFUNCADDR15</name>
          <description>USB Transmit Functional Address Endpoint 15</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFUNCADDR15_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBADDR15</name>
          <description>USB Transmit Hub Address Endpoint 15</description>
          <addressOffset>0x000000FA</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBADDR15_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_TXHUBADDR15_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHUBPORT15</name>
          <description>USB Transmit Hub Port Endpoint 15</description>
          <addressOffset>0x000000FB</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXHUBPORT15_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFUNCADDR15</name>
          <description>USB Receive Functional Address Endpoint 15</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFUNCADDR15_ADDR</name>
              <description>Device Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBADDR15</name>
          <description>USB Receive Hub Address Endpoint 15</description>
          <addressOffset>0x000000FE</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBADDR15_ADDR</name>
              <description>Hub Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>USB_RXHUBADDR15_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXHUBPORT15</name>
          <description>USB Receive Hub Port Endpoint 15</description>
          <addressOffset>0x000000FF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXHUBPORT15_PORT</name>
              <description>Hub Port</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_ERROR</name>
              <description>Error</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_REQPKT</name>
              <description>Request Packet</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STATUS</name>
              <description>STATUS Packet</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRH0</name>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DT</name>
              <description>Data Toggle</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRH0_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TYPE0</name>
          <description>USB Type Endpoint 0</description>
          <addressOffset>0x0000010A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TYPE0_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TYPE0_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NAKLMT</name>
          <description>USB NAK Limit</description>
          <addressOffset>0x0000010B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_NAKLMT_NAKLMT</name>
              <description>EP0 NAK Limit</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_ERROR</name>
              <description>Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_SETUP</name>
              <description>Setup Packet</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_NAKTO</name>
              <description>NAK Timeout</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
