lkolbly/cmsis-svd/data/TexasInstruments/LM3S5U91.svd
        <register>
          <name>FIFOLVL</name>
          <description>EPI FIFO Level Selects</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>EPI_FIFOLVL_RDFIFO</name>
              <description>Read FIFO</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_EMPT</name>
                  <description>Empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_8</name>
                  <description>Trigger when there are 1 or more entries in the NBRFIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_4</name>
                  <description>Trigger when there are 2 or more entries in the NBRFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_2</name>
                  <description>Trigger when there are 4 or more entries in the NBRFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_3_4</name>
                  <description>Trigger when there are 6 or more entries in the NBRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_7_8</name>
                  <description>Trigger when there are 7 or more entries in the NBRFIFO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_FULL</name>
                  <description>Trigger when there are 8 entries in the NBRFIFO</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_WRFIFO</name>
              <description>Write FIFO</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_EMPT</name>
                  <description>Trigger when there are 1 to 4 spaces available in the WFIFO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1_4</name>
                  <description>Trigger when there are 1 to 3 spaces available in the WFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1_2</name>
                  <description>Trigger when there are 1 to 2 spaces available in the WFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_3_4</name>
                  <description>Trigger when there is 1 space available in the WFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_RSERR</name>
              <description>Read Stall Error</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_FIFOLVL_WFERR</name>
              <description>Write Full Error</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WFIFOCNT</name>
          <description>EPI Write FIFO Count</description>
          <addressOffset>0x00000204</addressOffset>
          <fields>
            <field>
              <name>EPI_WFIFOCNT_WTAV</name>
              <description>Available Write Transactions</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>EPI Interrupt Mask</description>
          <addressOffset>0x00000210</addressOffset>
          <fields>
            <field>
              <name>EPI_IM_ERRIM</name>
              <description>Error Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_IM_RDIM</name>
              <description>Read Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_IM_WRIM</name>
              <description>Write Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>EPI Raw Interrupt Status</description>
          <addressOffset>0x00000214</addressOffset>
          <fields>
            <field>
              <name>EPI_RIS_ERRRIS</name>
              <description>Error Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_RDRIS</name>
              <description>Read Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_WRRIS</name>
              <description>Write Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>EPI Masked Interrupt Status</description>
          <addressOffset>0x00000218</addressOffset>
          <fields>
            <field>
              <name>EPI_MIS_ERRMIS</name>
              <description>Error Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_RDMIS</name>
              <description>Read Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_WRMIS</name>
              <description>Write Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EISC</name>
          <description>EPI Error Interrupt Status and Clear</description>
          <addressOffset>0x0000021C</addressOffset>
          <fields>
            <field>
              <name>EPI_EISC_TOUT</name>
              <description>Timeout Error</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_RSTALL</name>
              <description>Read Stalled Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_WTFULL</name>
              <description>Write FIFO Full Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
